John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        const char* repoApi = "https://api.github.com/repos/John-Varghese-EH/ESP32CAM-ONVIF/releases/latest";
        if (http.begin(client, repoApi)) {
            int httpCode = http.GET();
            if (httpCode == HTTP_CODE_OK) {
                String payload = http.getString();
                
                // Extract version tag
                String latestVer = "";
                int tagStart = payload.indexOf("\"tag_name\":");
                if (tagStart > 0) {
                    tagStart = payload.indexOf("\"", tagStart + 11) + 1;
                    int tagEnd = payload.indexOf("\"", tagStart);
                    latestVer = payload.substring(tagStart, tagEnd);
                }
                
                // Extract download URL
                String firmwareUrl = "";
                int urlStart = payload.indexOf("\"browser_download_url\":");
                if (urlStart > 0) {
                    urlStart = payload.indexOf("\"", urlStart + 23) + 1;
                    int urlEnd = payload.indexOf("\"", urlStart);
                    firmwareUrl = payload.substring(urlStart, urlEnd);
                }
                
                http.end();
                
                s_latest_version = latestVer;
                s_download_url = firmwareUrl;
                
                String json = "{\"current_version\":\"" FIRMWARE_VERSION "\",\"latest_version\":\"" + latestVer + "\",\"download_url\":\"" + firmwareUrl + "\"}";
                webConfigServer.send(200, "application/json", json);
            } else {
                http.end();
                webConfigServer.send(200, "application/json", "{\"error\":\"Failed to fetch GitHub release\"}");
            }
        } else {
            webConfigServer.send(200, "application/json", "{\"error\":\"Connection failed\"}");
        }
    });

    // --- GitHub Install ---
    webConfigServer.on("/api/update/github", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<256> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String url = doc["url"].as<String>();
        
        if (url == "") url = s_download_url;
        
        if (url == "") {
            webConfigServer.send(200, "application/json", "{\"error\":\"No download URL provided\"}");
            return;
        }
        
        s_ota_progress = 0;
        s_ota_msg = "Downloading firmware...";
        
        // Start background FreeRTOS task for downloading
        // We must duplicate the string so it survives
        char* url_copy = strdup(url.c_str());
        xTaskCreatePinnedToCore([](void* pvParam) {
            char* downloadUrl = (char*)pvParam;
            
            WiFiClientSecure client;
            client.setInsecure();
            HTTPClient http;
            
            if (http.begin(client, downloadUrl)) {
                http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
                int fwCode = http.GET();
                if (fwCode == HTTP_CODE_OK) {
                    int contentLength = http.getSize();
                    bool canBegin = Update.begin(contentLength);
                    if (canBegin) {
                        WiFiClient* stream = http.getStreamPtr();
                        size_t written = 0;
                        uint8_t buf[1024];
                        while (http.connected() && (written < contentLength)) {
                            size_t available = stream->available();
                            if (available) {
                                size_t toRead = (available > sizeof(buf)) ? sizeof(buf) : available;
                                size_t c = stream->readBytes(buf, toRead);
                                Update.write(buf, c);
                                written += c;
                                
                                s_ota_progress = (int)((written * 100) / contentLength);
                                if (s_ota_progress > 99) s_ota_progress = 99; // Cap at 99 until end
                            }
                            delay(1);
                        }
                        
                        if (written == contentLength && Update.end()) {
                            s_ota_progress = 100;
                            s_ota_msg = "Rebooting...";
                            delay(1000);
                            ESP.restart();
                        } else {
                            s_ota_progress = -1;
                            s_ota_msg = "Write failed";
                        }
                    } else {
                        s_ota_progress = -1;
                        s_ota_msg = "Not enough space";
                    }
                } else {
                    s_ota_progress = -1;
                    s_ota_msg = "HTTP GET failed";
                }
                http.end();
            } else {
                s_ota_progress = -1;
                s_ota_msg = "Connection failed";
            }
            free(downloadUrl);
            vTaskDelete(NULL);
        }, "github_ota_task", 8192, url_copy, 1, NULL, 1);
        
        webConfigServer.send(200, "application/json", "{\"success\":true}");
    });

    // --- GitHub Status ---
    webConfigServer.on("/api/update/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String json = "{\"progress\":" + String(s_ota_progress) + ",\"message\":\"" + s_ota_msg + "\"}";
        webConfigServer.send(200, "application/json", json);
    });

    webConfigServer.on("/api/system/info", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        sensor_t * s = esp_camera_sensor_get();
        framesize_t res = s->status.framesize;
        
        const char* resolution = "Custom";
        switch(res) {
            case FRAMESIZE_QQVGA: resolution = "QQVGA (160x120)"; break;
            case FRAMESIZE_QVGA:  resolution = "QVGA (320x240)"; break;
            case FRAMESIZE_VGA:   resolution = "VGA (640x480)"; break;
            case FRAMESIZE_SVGA:  resolution = "SVGA (800x600)"; break;
            case FRAMESIZE_HD:    resolution = "HD (1280x720)"; break;
            case FRAMESIZE_SXGA:  resolution = "SXGA (1280x1024)"; break;
            case FRAMESIZE_UXGA:  resolution = "UXGA (1600x1200)"; break;
            default: break;
        }
        
