John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        
        if (err || !doc.containsKey("ssid") || !doc.containsKey("password")) {
            webConfigServer.send(400, "application/json", "{\"success\":false,\"message\":\"Invalid request\"}");
            return;
        }
        
        String ssid = doc["ssid"].as<String>();
        String password = doc["password"].as<String>();
        
        // Save credentials
        if (wifiManager.saveCredentials(ssid, password)) {
            // Try to connect
            bool connected = wifiManager.connectToNetwork(ssid, password);
            
            if (connected) {
                webConfigServer.send(200, "application/json", "{\"success\":true,\"message\":\"Connected\"}");
                
                // Optional: schedule a restart after a short delay to ensure response is sent
                delay(1000);
                ESP.restart();
            } else {
                webConfigServer.send(200, "application/json", "{\"success\":false,\"message\":\"Failed to connect\"}");
            }
        } else {
            webConfigServer.send(500, "application/json", "{\"success\":false,\"message\":\"Failed to save credentials\"}");
        }
    });

    // === STREAM ENDPOINT ===
    webConfigServer.on("/stream", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        // Guard: only one concurrent stream client
        if (s_streamActive) {
            webConfigServer.send(503, "text/plain", "Stream busy - another client is connected");
            return;
        }
        s_streamActive = true;
        
        WiFiClient client = webConfigServer.client();
        
        // Security: restrict CORS to same-origin (removed wildcard)
        String response = "HTTP/1.1 200 OK\r\n";
        response += "Content-Type: multipart/x-mixed-replace; boundary=frame\r\n";
        response += "X-Content-Type-Options: nosniff\r\n";
        response += "\r\n";
        client.print(response);

        Serial.println("[INFO] MJPEG Stream started");
        
        // Optimize TCP for streaming
        client.setTimeout(2); // Set low timeout for writes (2s) to prevent blocking
        
        int64_t last_frame = 0;
        const int frame_interval = 100; // 100ms = ~10 FPS

        while (client.connected()) {
            // CRITICAL: Feed the Watchdog Timer so the ESP32 doesn't reboot
            esp_task_wdt_reset();
            
            // Keep critical background tasks alive (God Loop Pattern)
            rtsp_server_loop();   
            onvif_server_loop();
            
            int64_t now = esp_timer_get_time() / 1000;
            if (now - last_frame < frame_interval) {
                // Yield to allow WiFi stack to process
                yield(); 
                delay(10); // Sleep 10ms to save CPU
                continue;
            }
            last_frame = now;

            camera_fb_t *fb = esp_camera_fb_get();
            if (!fb) {
                Serial.println("[WARN] Frame buffer failed");
                delay(100);
                continue;
            }
            
            // Send buffer using chunked writes if needed, but client.write handles it.
            // Check if we can write to avoid stalling on full buffer
            // (Standard Client doesn't expose availableForWrite easily on all cores, but write() is blocking with timeout)
            
            size_t dataLen = fb->len; // Cache before releasing!
            size_t hlen = client.printf("--frame\r\nContent-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n", dataLen);
            
            // Implement chunked write to prevent WiFiClient buffer drops on large frames
            size_t wlen = 0;
            const size_t chunkSize = 2048;
            for (size_t i = 0; i < dataLen; i += chunkSize) {
                size_t toWrite = (dataLen - i < chunkSize) ? (dataLen - i) : chunkSize;
                size_t written = client.write(fb->buf + i, toWrite);
                if (written != toWrite) {
                    break;
                }
                wlen += written;
            }
            
            client.print("\r\n");
            
            esp_camera_fb_return(fb); // Release immediately
            
            if (wlen != dataLen) {
                 Serial.printf("[WARN] Stream write failed (Sent %u of %u bytes). Client disconnected?\n", wlen, dataLen);
                 break;
            }
        }
        
        Serial.println("[INFO] MJPEG Stream stopped");
        s_streamActive = false;
    });

    // --- Snapshot endpoint ---
    webConfigServer.on("/snapshot", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        camera_fb_t *fb = esp_camera_fb_get();
        if (!fb) {
            webConfigServer.send(500, "text/plain", "Camera Error");
            return;
        }
        webConfigServer.sendHeader("Content-Type", "image/jpeg");
        webConfigServer.send_P(200, "image/jpeg", (char*)fb->buf, fb->len);
        esp_camera_fb_return(fb);
    });

    // --- Bluetooth Endpoints ---
    #ifdef BLUETOOTH_ENABLED
    webConfigServer.on("/api/bt/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        String json = "{";
        json += "\"enabled\":" + String(appSettings.btEnabled ? "true" : "false") + ",";
        json += "\"stealth\":" + String(appSettings.btStealthMode ? "true" : "false") + ",";
        json += "\"mac\":\"" + String(appSettings.btPresenceMac) + "\",";
        json += "\"userPresent\":" + String(btManager.isUserPresent() ? "true" : "false") + ",";
        json += "\"audioSource\":" + String(appSettings.audioSource) + ",";
        json += "\"gain\":" + String(appSettings.btMicGain) + ",";
        json += "\"timeout\":" + String(appSettings.btPresenceTimeout);
        json += "}";
        webConfigServer.send(200, "application/json", json);
    });

    webConfigServer.on("/api/bt/config", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        if(doc.containsKey("enabled")) appSettings.btEnabled = doc["enabled"];
        if(doc.containsKey("stealth")) appSettings.btStealthMode = doc["stealth"];
        if(doc.containsKey("mac")) strncpy(appSettings.btPresenceMac, doc["mac"] | "", sizeof(appSettings.btPresenceMac) - 1);
        if(doc.containsKey("gain")) appSettings.btMicGain = doc["gain"];
        if(doc.containsKey("timeout")) appSettings.btPresenceTimeout = doc["timeout"];
        if(doc.containsKey("audioSource")) {
             int src = doc["audioSource"];
             appSettings.audioSource = (AudioSource)src;
             audioManager.begin(); // Re-init audio with new source
        }
        
        saveSettings();
        
        // If enabling BT, start it
        if (appSettings.btEnabled) btManager.begin();
        
