John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    webConfigServer.on("/api/bt/scan", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        // Trigger scan if not enabled?
        // Return latest cache
        webConfigServer.send(200, "application/json", btManager.getLastScanResult());
    });
    #endif // BLUETOOTH_ENABLED
    
    // === OTA Firmware Update (with authentication) ===
    webConfigServer.on("/api/update", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        bool success = !Update.hasError();
        webConfigServer.send(200, "application/json", 
            success ? "{\"success\":true}" : "{\"success\":false}");
        if (success) {
            delay(500);
            ESP.restart();
        }
    }, []() {
        // Auth check on upload start
        if (!webConfigServer.authenticate(WEB_USER, WEB_PASS)) {
            return;
        }
        HTTPUpload& upload = webConfigServer.upload();
        if (upload.status == UPLOAD_FILE_START) {
            Serial.printf("[OTA] Update: %s\n", upload.filename.c_str());
            if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
            if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_END) {
            if (Update.end(true)) {
                Serial.printf("[OTA] Success: %u bytes\n", upload.totalSize);
            } else {
                Update.printError(Serial);
            }
        }
    });

    webConfigServer.begin();
        Serial.println("[INFO] Web config server started.");
    }

    void web_config_loop() {
        webConfigServer.handleClient();
        
        // Track heap low-water mark for fragmentation monitoring
        uint32_t freeHeap = ESP.getFreeHeap();
        if (freeHeap < s_minFreeHeap) {
            s_minFreeHeap = freeHeap;
        }
    }